Repository: Trio-Apps/FormBuilderApiProject
Catalog: FormBuilder.Services/Resources/FormulaService.*.resx
Languages: ar

# Formula_CodeRequired
source: Formula code is required.
ar: كود الصيغة مطلوب.

source: Formula not found.
ar: الصيغة غير موجودة.

# Formula_DtoRequired
source: DTO is required.
ar: البيانات المطلوبة غير موجودة.

# Formula_FormBuilderNotFound
source: Form builder not found.
ar: النموذج غير موجود.

# Formula_ResultFieldNotFound
source: Result field not found or doesn't belong to the form.
ar: حقل النتيجة غير موجود أو لا ينتمي إلى النموذج.

# Formula_ExpressionValidationFailed
source: Expression validation failed.
ar: فشل التحقق من التعبير.

# Formula_CreateFailed
source: Failed to create formula.
ar: فشل إنشاء الصيغة.

# Formula_CodeExists
source: Formula code already exists for this form.
ar: كود الصيغة مستخدم بالفعل لهذا النموذج.

# Formula_CannotDeleteWithVariables
source: Cannot delete formula because it has associated variables. Delete variables first.
ar: لا يمكن حذف الصيغة لأنها تحتوي على متغيرات مرتبطة. احذف المتغيرات أولاً.

# Formula_NoFormulasFound
source: No formulas found for this form builder.
ar: لم يتم العثور على صيغ لهذا النموذج.

# Formula_CannotDeleteMultipleWithVariables
source: Cannot delete {0} formulas because they have associated variables. Delete variables first.
ar: لا يمكن حذف {0} صيغة لأنها تحتوي على متغيرات مرتبطة. احذف المتغيرات أولاً.

# Formula_SearchTermRequired
source: Search term is required.
ar: مصطلح البحث مطلوب.

# Formula_InvalidFieldCodes
source: Invalid field codes found: {0}.
ar: تم العثور على أكواد حقول غير صالحة: {0}.

# Formula_DuplicateDtoRequired
source: Duplicate DTO is required.
ar: البيانات المطلوبة للنسخ غير موجودة.

# Formula_SourceNotFound
source: Source formula not found.
ar: الصيغة المصدر غير موجودة.

# Formula_PreviewDtoRequired
source: Preview calculation DTO is required.
ar: البيانات المطلوبة لمعاينة الحساب غير موجودة.

# Formula_ExpressionTextRequired
source: Expression text is required.
ar: نص التعبير مطلوب.

# Formula_CalculationError
source: Error calculating expression: {0}.
ar: خطأ في حساب التعبير: {0}.

# Formula_IdsRequired
source: Formula IDs are required.
ar: معرّفات الصيغ مطلوبة.
