Repository: Trio-Apps/FormBuilderApiProject
Catalog: frombuilderApiProject/Resources/AccountController.*.resx
Languages: ar

# Login_InvalidCredentials
source: Invalid username or password.
ar: اسم المستخدم أو كلمة المرور غير صحيحة.

# Auth_InvalidRefreshToken
source: Invalid refresh token.
ar: رمز التحديث غير صالح.

# Auth_LoggedOut
source: Logged out successfully.
ar: تم تسجيل الخروج بنجاح.

# Auth_InvalidUserId
source: Invalid user ID.
ar: معرّف المستخدم غير صالح.

# Auth_RevokeFailed
source: Failed to revoke tokens.
ar: فشل إلغاء جميع الرموز.

# Auth_RevokeSuccess
source: All user tokens revoked successfully.
ar: تم إلغاء جميع رموز المستخدم بنجاح.

# Auth_InvalidUserToken
source: Invalid user token.
ar: رمز المستخدم غير صالح.

# Auth_UserNotFound
source: User not found.
ar: المستخدم غير موجود.

# Auth_ChangePasswordFailed
source: Current password is incorrect or user not found.
ar: كلمة المرور الحالية غير صحيحة أو أن المستخدم غير موجود.

# Auth_ChangePasswordSuccess
source: Password changed successfully. All existing sessions have been revoked.
ar: تم تغيير كلمة المرور بنجاح، وتم إنهاء جميع الجلسات الحالية.
